{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"module": "keras.layer", "class_name": "InputLayer", "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_input", "config": {"batch_input_shape": [null, 4]}}, {"module": "keras.layer", "class_name": "Dense", "config": {"batch_input_shape": [null, 4], "name": "dense", "trainable": true, "dtype": "float32", "units": 20, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"module": "keras.layer", "class_name": "Dense", "config": {"batch_input_shape": [null, 20], "name": "dense_1", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"module": "keras.layer", "class_name": "Dense", "config": {"batch_input_shape": [null, 10], "name": "dense_2", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}